# проверить версию - 0 - git version
# .git - новая папка - показывает что вся эта директория совместима с git'om (git init)
# git add <File> для добавления файла в посылку \ git add -A для добавления всех
# git commit -m "Комментарий" - подтверждение изменений
# git remote add origin <Путь к вашему репозиторию> - подключение к репозиторию
# git push origin <Название ветки> - публикация изменений

# git status - проверка состояния посылки на данный момент
# git pull origin <Ветка> - получение изменений из конкретной ветки
# git branch -M <Название ветки> - создание новой ветки
# git checkout - проверка веток